---
"description": "Откройте для себя максимальное количество строк и столбцов, поддерживаемых форматами XLS и XLSX, используя Aspose.Cells для .NET. Максимизируйте управление данными Excel с помощью этого всеобъемлющего руководства."
"linktitle": "Найдите максимальное количество строк и столбцов, поддерживаемых форматами XLS и XLSX"
"second_title": "API обработки Excel Aspose.Cells .NET"
"title": "Найдите максимальное количество строк и столбцов, поддерживаемых форматами XLS и XLSX"
"url": "/ru/net/workbook-settings/find-maximum-supported-rows-columns/"
"weight": 11
---

{{< blocks/products/pf/main-wrap-class >}}

{{< blocks/products/pf/main-container >}}

{{< blocks/products/pf/tutorial-page-section >}}

# Найдите максимальное количество строк и столбцов, поддерживаемых форматами XLS и XLSX

## Введение
В мире Excel управление большими наборами данных может быть сложной задачей, особенно когда дело касается обработки максимального количества строк и столбцов, поддерживаемых различными форматами файлов. Это руководство проведет вас через процесс поиска максимального количества строк и столбцов, поддерживаемых форматами XLS и XLSX, с использованием библиотеки Aspose.Cells for .NET. К концу этой статьи вы получите полное представление о том, как использовать этот мощный инструмент для эффективного выполнения задач, связанных с Excel.
## Предпосылки
Прежде чем приступить к изучению руководства, убедитесь, что у вас выполнены следующие предварительные условия:
1. [.NET Framework](https://dotnet.microsoft.com/en-us/download) или [.NET Core](https://dotnet.microsoft.com/en-us/download) установлен в вашей системе.
2. [Aspose.Cells для .NET](https://releases.aspose.com/cells/net/) библиотека загружена и указана в вашем проекте.
Если вы еще этого не сделали, вы можете загрузить библиотеку Aspose.Cells for .NET с сайта [веб-сайт](https://releases.aspose.com/cells/net/) или установите его через [NuGet](https://www.nuget.org/packages/Aspose.Cells/).
## Импортные пакеты
Для начала вам нужно импортировать необходимые пакеты из библиотеки Aspose.Cells for .NET. Добавьте следующие операторы using в начало вашего файла C#:
```csharp
using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;
```
## Шаг 1: Найдите максимальное количество строк и столбцов, поддерживаемых форматом XLS
Начнем с изучения максимального количества строк и столбцов, поддерживаемых форматом XLS (Excel 97-2003).
```csharp
// Распечатать сообщение о формате XLS.
Console.WriteLine("Maximum Rows and Columns supported by XLS format.");
// Создать рабочую книгу в формате XLS.
Workbook wb = new Workbook(FileFormatType.Excel97To2003);
// Распечатать максимальное количество строк и столбцов, поддерживаемых форматом XLS.
int maxRows = wb.Settings.MaxRow + 1;
int maxCols = wb.Settings.MaxColumn + 1;
Console.WriteLine("Maximum Rows: " + maxRows);
Console.WriteLine("Maximum Columns: " + maxCols);
Console.WriteLine();
```
На этом этапе мы:
1. Распечатать сообщение о том, что мы работаем с форматом XLS.
2. Создать новый `Workbook` например, используя `FileFormatType.Excel97To2003` enum, представляющий формат XLS.
3. Получите максимальное количество строк и столбцов, поддерживаемых форматом XLS, используя `Workbook.Settings.MaxRow` и `Workbook.Settings.MaxColumn` свойства, соответственно. Мы добавляем 1 к этим значениям, чтобы получить фактические максимальные номера строк и столбцов (поскольку они начинаются с нуля).
4. Вывести максимальное количество строк и столбцов на консоль.
## Шаг 2: Найдите максимальное количество строк и столбцов, поддерживаемых форматом XLSX
Далее давайте рассмотрим максимальное количество строк и столбцов, поддерживаемых форматом XLSX (Excel 2007 и более поздние версии).
```csharp
// Распечатать сообщение о формате XLSX.
Console.WriteLine("Maximum Rows and Columns supported by XLSX format.");
// Создать рабочую книгу в формате XLSX.
wb = new Workbook(FileFormatType.Xlsx);
// Распечатать максимальное количество строк и столбцов, поддерживаемых форматом XLSX.
maxRows = wb.Settings.MaxRow + 1;
maxCols = wb.Settings.MaxColumn + 1;
Console.WriteLine("Maximum Rows: " + maxRows);
Console.WriteLine("Maximum Columns: " + maxCols);
```
На этом этапе мы:
1. Вывести сообщение о том, что мы работаем с форматом XLSX.
2. Создать новый `Workbook` например, используя `FileFormatType.Xlsx` enum, представляющий формат XLSX.
3. Получите максимальное количество строк и столбцов, поддерживаемых форматом XLSX, используя `Workbook.Settings.MaxRow` и `Workbook.Settings.MaxColumn` свойства, соответственно. Мы добавляем 1 к этим значениям, чтобы получить фактические максимальные номера строк и столбцов (поскольку они начинаются с нуля).
4. Вывести максимальное количество строк и столбцов на консоль.
## Шаг 3: Отображение сообщения об успешном завершении
Наконец, давайте выведем сообщение об успешном выполнении, указывающее на то, что пример «FindMaximumRowsAndColumnsSupportedByXLSAndXLSXFormats» выполнен успешно.
```csharp
Console.WriteLine("FindMaximumRowsAndColumnsSupportedByXLSAndXLSXFormats executed successfully.");
```
Этот шаг просто выводит сообщение об успешном выполнении на консоль.
## Заключение
В этом руководстве вы узнали, как использовать библиотеку Aspose.Cells for .NET для поиска максимального количества строк и столбцов, поддерживаемых форматами файлов XLS и XLSX. Понимая ограничения этих форматов, вы сможете лучше планировать и управлять своими проектами на основе Excel, гарантируя, что ваши данные будут соответствовать поддерживаемым диапазонам.
## Часто задаваемые вопросы
### Какое максимальное количество строк поддерживается форматом XLS?
Максимальное количество строк, поддерживаемых форматом XLS (Excel 97-2003), составляет 65 536.
### Какое максимальное количество столбцов поддерживает формат XLS?
Максимальное количество столбцов, поддерживаемых форматом XLS (Excel 97-2003), составляет 256.
### Какое максимальное количество строк поддерживается форматом XLSX?
Максимальное количество строк, поддерживаемых форматом XLSX (Excel 2007 и более поздние версии), составляет 1 048 576.
### Какое максимальное количество столбцов поддерживает формат XLSX?
Максимальное количество столбцов, поддерживаемых форматом XLSX (Excel 2007 и более поздние версии), составляет 16 384.
### Можно ли использовать библиотеку Aspose.Cells for .NET для работы с другими форматами файлов Excel?
Да, библиотека Aspose.Cells for .NET поддерживает широкий спектр форматов файлов Excel, включая XLS, XLSX, ODS и другие. Вы можете изучить [документация](https://reference.aspose.com/cells/net/) чтобы узнать о доступных функциях и возможностях.


{{< /blocks/products/pf/tutorial-page-section >}}

{{< /blocks/products/pf/main-container >}}

{{< /blocks/products/pf/main-wrap-class >}}

{{< blocks/products/products-backtop-button >}}